atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/uart_driver.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2020-2022 Davide Bettio <davide@uninstall.it>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include <sdkconfig.h>
#ifdef CONFIG_AVM_ENABLE_UART_PORT_DRIVER

#include <assert.h>
#include <stdlib.h>
#include <string.h>

#include <driver/uart.h>
#include <esp_log.h>
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
#include <soc/gpio_num.h>
#endif

#if SOC_USB_SERIAL_JTAG_SUPPORTED
#include <driver/usb_serial_jtag.h>
#include <freertos/FreeRTOS.h>
#include <freertos/ringbuf.h>
#include <freertos/semphr.h>
#include <freertos/task.h>
#define AVM_USJ_RX_BUF_SIZE 1024
#define AVM_USJ_TX_BUF_SIZE 1024
#define AVM_USJ_READ_CHUNK 64
#define AVM_USJ_READ_TIMEOUT_MS 50
#define AVM_USJ_STOP_TIMEOUT_MS 200
#endif

#include "atom.h"
#include "bif.h"
#include "context.h"
#include "debug.h"
#include "defaultatoms.h"
#include "globalcontext.h"
#include "interop.h"
#include "mailbox.h"
#include "module.h"
#include "platform_defaultatoms.h"
#include "port.h"
#include "scheduler.h"
#include "smp.h"
#include "term.h"
#include "utils.h"

#include "trace.h"

#include "esp32_sys.h"
#include "sys.h"

static Context *uart_driver_create_port(GlobalContext *global, term opts);
static NativeHandlerResult uart_driver_consume_mailbox(Context *ctx);

#define TAG "uart_driver"
#define UART_BUF_SIZE 256
#define NO_REF 0
#define NO_READER term_invalid_term()
#define PIN_ERROR -2

#ifndef GPIO_NUM_MAX // remove conditional after ESP_IDF v5.1 is deprecated
#define GPIO_NUM_MAX SOC_GPIO_PIN_COUNT
#endif

struct UARTData
{
    QueueHandle_t rxqueue;
    EventListener listener;
    term reader_process_pid;
    uint64_t reader_ref_ticks;
    uint8_t uart_num;
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    bool use_usj;
    volatile bool usj_stop;
    RingbufHandle_t usj_rx_ringbuf;
    TaskHandle_t usj_reader_task;
    SemaphoreHandle_t usj_reader_stopped;
#endif
#ifndef AVM_NO_SMP
    Mutex *reader_lock;
#endif
};

static const AtomStringIntPair parity_table[] = {
    { ATOM_STR("\x4", "none"), UART_PARITY_DISABLE },
    { ATOM_STR("\x4", "even"), UART_PARITY_EVEN },
    { ATOM_STR("\x3", "odd"), UART_PARITY_ODD },
    SELECT_INT_DEFAULT(-1)
};

static const AtomStringIntPair flow_control_table[] = {
    { ATOM_STR("\x4", "none"), UART_HW_FLOWCTRL_DISABLE },
    { ATOM_STR("\x8", "hardware"), UART_HW_FLOWCTRL_CTS_RTS },
    { ATOM_STR("\x8", "software"), -1 },
    SELECT_INT_DEFAULT(-1)
};

enum uart_cmd
{
    UARTInvalidCmd = 0,
    UARTReadCmd = 1,
    UARTWriteCmd = 2,
    UARTCloseCmd = 3,
    UARTCancelCmd = 4
};

static const AtomStringIntPair cmd_table[] = {
    { ATOM_STR("\x4", "read"), UARTReadCmd },
    { ATOM_STR("\x5", "write"), UARTWriteCmd },
    { ATOM_STR("\x5", "close"), UARTCloseCmd },
    { ATOM_STR("\xB", "cancel_read"), UARTCancelCmd },
    SELECT_INT_DEFAULT(UARTInvalidCmd)
};

static void safe_update_reader_data(struct UARTData *uart_data, term pid, uint64_t ref_ticks)
{
    SMP_MUTEX_LOCK(uart_data->reader_lock);
    uart_data->reader_process_pid = pid;
    uart_data->reader_ref_ticks = ref_ticks;
    SMP_MUTEX_UNLOCK(uart_data->reader_lock);
}

#if SOC_USB_SERIAL_JTAG_SUPPORTED
static void usj_reader_task(void *arg)
{
    struct UARTData *uart_data = arg;
    uint8_t buf[AVM_USJ_READ_CHUNK];
    while (!uart_data->usj_stop) {
        int n = usb_serial_jtag_read_bytes(buf, sizeof(buf), pdMS_TO_TICKS(AVM_USJ_READ_TIMEOUT_MS));
        if (n <= 0) {
            continue;
        }
        if (xRingbufferSend(uart_data->usj_rx_ringbuf, buf, n, pdMS_TO_TICKS(100)) != pdTRUE) {
            ESP_LOGW(TAG, "USB_SERIAL_JTAG rx ringbuf full, dropping %d bytes", n);
            continue;
        }
        uart_event_t event = { .type = UART_DATA, .size = 0 };
        if (uxQueueMessagesWaiting(uart_data->rxqueue) == 0
            && xQueueSend(uart_data->rxqueue, &event, 0) != pdTRUE) {
            ESP_LOGW(TAG, "USB_SERIAL_JTAG event queue full");
        }
    }
    if (uart_data->usj_reader_stopped != NULL) {
        xSemaphoreGive(uart_data->usj_reader_stopped);
    }
    vTaskDelete(NULL);
}

static void usj_stop_reader_task(struct UARTData *uart_data)
{
    if (uart_data->usj_reader_task != NULL) {
        uart_data->usj_stop = true;
        if (uart_data->usj_reader_stopped != NULL
            && xSemaphoreTake(uart_data->usj_reader_stopped, pdMS_TO_TICKS(AVM_USJ_STOP_TIMEOUT_MS)) != pdTRUE) {
            ESP_LOGW(TAG, "USB_SERIAL_JTAG reader task did not stop cleanly");
            vTaskDelete(uart_data->usj_reader_task);
        }
        uart_data->usj_reader_task = NULL;
    }
    if (uart_data->usj_reader_stopped != NULL) {
        vSemaphoreDelete(uart_data->usj_reader_stopped);
        uart_data->usj_reader_stopped = NULL;
    }
}

static size_t usj_rx_available(struct UARTData *uart_data)
{
    UBaseType_t avail = 0;
    vRingbufferGetInfo(uart_data->usj_rx_ringbuf, NULL, NULL, NULL, NULL, &avail);
    return (size_t) avail;
}

static size_t usj_drain_rx(struct UARTData *uart_data, uint8_t *out, size_t max_len)
{
    size_t total = 0;
    while (total < max_len) {
        size_t recv_size = 0;
        void *item = xRingbufferReceiveUpTo(uart_data->usj_rx_ringbuf,
            &recv_size, 0, max_len - total);
        if (item == NULL || recv_size == 0) {
            break;
        }
        memcpy(out + total, item, recv_size);
        total += recv_size;
        vRingbufferReturnItem(uart_data->usj_rx_ringbuf, item);
    }
    return total;
}
#endif

