atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/uart_driver.c
EventListener *uart_interrupt_callback(GlobalContext *glb, EventListener *listener)
{
    struct UARTData *uart_data = GET_LIST_ENTRY(listener, struct UARTData, listener);

    uart_event_t event;
    if (xQueueReceive(uart_data->rxqueue, (void *) &event, (TickType_t) 0)) {
        switch (event.type) {
            case UART_DATA_BREAK:
            case UART_DATA:
                if (uart_data->reader_process_pid != term_invalid_term()) {
                    size_t count = event.size;
                    uint8_t *usj_buf = NULL;
#if SOC_USB_SERIAL_JTAG_SUPPORTED
                    if (uart_data->use_usj) {
                        count = usj_rx_available(uart_data);
                        if (count == 0) {
                            break;
                        }
                        usj_buf = malloc(count);
                        if (IS_NULL_PTR(usj_buf)) {
                            fprintf(stderr, "Failed to allocate memory size %i: %s:%i.\n", (int) count, __FILE__, __LINE__);
                            AVM_ABORT();
                        }
                        count = usj_drain_rx(uart_data, usj_buf, count);
                        if (count == 0) {
                            free(usj_buf);
                            break;
                        }
                    }
#endif
                    int bin_size = term_binary_heap_size(count);

                    Heap heap;
                    if (UNLIKELY(memory_init_heap(&heap, bin_size + TERM_BOXED_REFERENCE_SHORT_SIZE + TUPLE_SIZE(2) * 2) != MEMORY_GC_OK)) {
                        free(usj_buf);
                        fprintf(stderr, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
                        AVM_ABORT();
                    }

                    term bin = term_create_uninitialized_binary(count, &heap, glb);
                    uint8_t *bin_buf = (uint8_t *) term_binary_data(bin);
#if SOC_USB_SERIAL_JTAG_SUPPORTED
                    if (uart_data->use_usj) {
                        memcpy(bin_buf, usj_buf, count);
                        free(usj_buf);
                    }
#endif
#if SOC_USB_SERIAL_JTAG_SUPPORTED
                    if (!uart_data->use_usj)
#endif
                    {
                        uart_read_bytes(uart_data->uart_num, bin_buf, count, portMAX_DELAY);
                    }

                    term ok_tuple = term_alloc_tuple(2, &heap);
                    term_put_tuple_element(ok_tuple, 0, OK_ATOM);
                    term_put_tuple_element(ok_tuple, 1, bin);

                    term ref = term_from_ref_ticks(uart_data->reader_ref_ticks, &heap);

                    term result_tuple = term_alloc_tuple(2, &heap);
                    term_put_tuple_element(result_tuple, 0, ref);
                    term_put_tuple_element(result_tuple, 1, ok_tuple);

                    int local_pid = term_to_local_process_id(uart_data->reader_process_pid);
                    globalcontext_send_message(glb, local_pid, result_tuple);

                    memory_destroy_heap(&heap, glb);
                    safe_update_reader_data(uart_data, NO_READER, NO_REF);
                }
                break;
            case UART_FIFO_OVF:
                ESP_LOGE(TAG, "FIFO overflow!");
                break;
            case UART_BUFFER_FULL:
                ESP_LOGW(TAG, "buffer is full!");
                break;
            case UART_BREAK:
                // TODO: handle single NULL char event?, or treat this like UART_DATA & UART_DATA_BREAK?
                break;
            case UART_PARITY_ERR:
                ESP_LOGE(TAG, "parity error detected!");
                break;
            case UART_FRAME_ERR:
                ESP_LOGE(TAG, "frame error detected!");
                break;
            case UART_PATTERN_DET:
                // MAYBE: add pattern detection for incoming uart messages
                break;
            default:
                break;
        }
    }

    return listener;
}

static int get_uart_pin_opt(term opts, term pin_name)
{
    _Static_assert(PIN_ERROR < UART_PIN_NO_CHANGE);
    term value = interop_proplist_get_value_default(opts, pin_name, DEFAULT_ATOM);
    if (value == DEFAULT_ATOM) {
        return UART_PIN_NO_CHANGE;
    } else if (!term_is_integer(value)) {
        ESP_LOGE(TAG, "pin must be an integer!");
        return PIN_ERROR;
    } else {
        int pin_num = term_to_int(value);
        if (UNLIKELY(pin_num < UART_PIN_NO_CHANGE || pin_num > GPIO_NUM_MAX)) {
            ESP_LOGE(TAG, "pin number %i is out of range [default | -1..%i]", pin_num, GPIO_NUM_MAX);
            return PIN_ERROR;
        }
        return term_to_int(value);
    }
}

Context *uart_driver_create_port(GlobalContext *global, term opts)
{
    term uart_name_term = interop_kv_get_value_default(opts, ATOM_STR("\xA", "peripheral"),
        UNDEFINED_ATOM, global);
    term uart_speed_term = interop_proplist_get_value_default(opts, SPEED_ATOM, term_from_int(115200));

    term data_bits_term = interop_proplist_get_value_default(opts, DATA_BITS_ATOM, term_from_int(8));
    term stop_bits_term = interop_proplist_get_value_default(opts, STOP_BITS_ATOM, term_from_int(1));
    term flow_control_term = interop_proplist_get_value_default(opts, FLOW_CONTROL_ATOM, NONE_ATOM);
    term parity_term = interop_proplist_get_value_default(opts, PARITY_ATOM, NONE_ATOM);

    int tx_pin = get_uart_pin_opt(opts, TX_ATOM);
    int rx_pin = get_uart_pin_opt(opts, RX_ATOM);
    int rts_pin = get_uart_pin_opt(opts, RTS_ATOM);
    int cts_pin = get_uart_pin_opt(opts, CTS_ATOM);
    if (UNLIKELY(tx_pin == PIN_ERROR || rx_pin == PIN_ERROR
            || rts_pin == PIN_ERROR || cts_pin == PIN_ERROR)) {
        // error already logged in get_uart_pin_opts
        return NULL;
    }

    term event_queue_len_term = interop_proplist_get_value_default(opts, EVENT_QUEUE_LEN_ATOM, term_from_int(16));
    if (!term_is_integer(event_queue_len_term)) {
        ESP_LOGE(TAG, "event_queue_len must be an integer");
        return NULL;
    }
    int event_queue_len = term_to_int(event_queue_len_term);

    int ok;
    char *uart_name = interop_term_to_string(uart_name_term, &ok);
    if (!uart_name || !ok) {
        ESP_LOGE(TAG, "name must be character or binary string");
        return NULL;
    }

    uint8_t uart_num = 0;
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    bool use_usj = (strcmp(uart_name, "USB_SERIAL_JTAG") == 0);
    if (!use_usj) {
#endif
        if (!strcmp(uart_name, "UART0")) {
            uart_num = UART_NUM_0;
        } else if (!strcmp(uart_name, "UART1")) {
            uart_num = UART_NUM_1;
        }
#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S3)
        else if (!strcmp(uart_name, "UART2")) {
            uart_num = UART_NUM_2;
        }
#endif
        else {
            free(uart_name);
            ESP_LOGE(TAG, "invalid uart bus name!");
            return NULL;
        }
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    }
#endif
    free(uart_name);

    avm_int_t uart_speed = term_to_int(uart_speed_term);

    int data_bits;
    switch (term_to_int(data_bits_term)) {
        case 8:
            data_bits = UART_DATA_8_BITS;
            break;
        case 7:
            data_bits = UART_DATA_7_BITS;
            break;
        case 6:
            data_bits = UART_DATA_6_BITS;
            break;
        case 5:
            data_bits = UART_DATA_5_BITS;
            break;
        default:
            ESP_LOGE(TAG, "invalid data_bits!");
            return NULL;
    }

    int stop_bits;
    switch (term_to_int(stop_bits_term)) {
        case 1:
            stop_bits = UART_STOP_BITS_1;
            break;
        case 2:
            stop_bits = UART_STOP_BITS_2;
            break;
        default:
            ESP_LOGE(TAG, "invalid stop_bits!");
            return NULL;
    }

    uart_hw_flowcontrol_t flow_control = interop_atom_term_select_int(flow_control_table, flow_control_term, global);
    if (flow_control < 0) {
        ESP_LOGE(TAG, "invalid flow_control!");
        return NULL;
    }

    uart_parity_t parity = interop_atom_term_select_int(parity_table, parity_term, global);
    if (parity < 0) {
        ESP_LOGE(TAG, "invalid parity!");
        return NULL;
    }

