atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/uart_driver.c
    size_t alloc_size = sizeof(struct UARTData);
    struct UARTData *uart_data = calloc(1, alloc_size);
    if (IS_NULL_PTR(uart_data)) {
        fprintf(stderr, "Failed to allocate memory size %i: %s:%i.\n", (int) alloc_size, __FILE__, __LINE__);
        AVM_ABORT();
    }
    uart_data->listener.handler = uart_interrupt_callback;
    uart_data->reader_process_pid = term_invalid_term();
    uart_data->reader_ref_ticks = 0;
    uart_data->uart_num = uart_num;
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    uart_data->use_usj = use_usj;
#endif

#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (use_usj) {
        usb_serial_jtag_driver_config_t usj_cfg = {
            .rx_buffer_size = AVM_USJ_RX_BUF_SIZE,
            .tx_buffer_size = AVM_USJ_TX_BUF_SIZE,
        };
        if (usb_serial_jtag_driver_install(&usj_cfg) != ESP_OK) {
            ESP_LOGE(TAG, "failed to install USB_SERIAL_JTAG driver.");
            free(uart_data);
            return NULL;
        }
        uart_data->rxqueue = xQueueCreate(event_queue_len, sizeof(uart_event_t));
        if (uart_data->rxqueue == NULL) {
            ESP_LOGE(TAG, "failed to create USB_SERIAL_JTAG event queue.");
            usb_serial_jtag_driver_uninstall();
            free(uart_data);
            return NULL;
        }
        uart_data->usj_rx_ringbuf = xRingbufferCreate(AVM_USJ_RX_BUF_SIZE, RINGBUF_TYPE_BYTEBUF);
        if (uart_data->usj_rx_ringbuf == NULL) {
            ESP_LOGE(TAG, "failed to create USB_SERIAL_JTAG ringbuf.");
            vQueueDelete(uart_data->rxqueue);
            usb_serial_jtag_driver_uninstall();
            free(uart_data);
            return NULL;
        }
        uart_data->usj_reader_stopped = xSemaphoreCreateBinary();
        if (uart_data->usj_reader_stopped == NULL) {
            ESP_LOGE(TAG, "failed to create USB_SERIAL_JTAG reader semaphore.");
            vRingbufferDelete(uart_data->usj_rx_ringbuf);
            vQueueDelete(uart_data->rxqueue);
            usb_serial_jtag_driver_uninstall();
            free(uart_data);
            return NULL;
        }
    }
#endif
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (!use_usj)
#endif
    {
        uart_config_t uart_config = {
#if ESP_IDF_VERSION_MAJOR >= 5
            .source_clk = UART_SCLK_DEFAULT,
#endif
            .baud_rate = uart_speed,
            .data_bits = data_bits,
            .parity = parity,
            .stop_bits = stop_bits,
            .flow_ctrl = flow_control
        };
        uart_param_config(uart_num, &uart_config);
        uart_set_pin(uart_num, tx_pin, rx_pin, rts_pin, cts_pin);

        if (uart_driver_install(uart_num, UART_BUF_SIZE, 0, event_queue_len, &uart_data->rxqueue, 0) != ESP_OK) {
            ESP_LOGE(TAG, "failed to install uart driver.");
            free(uart_data);
            return NULL;
        }
    }

    uart_data->listener.sender = uart_data->rxqueue;
#ifndef AVM_NO_SMP
    uart_data->reader_lock = smp_mutex_create();
#endif
    sys_register_listener(global, &uart_data->listener);

    // xQueueAddToSet requires an empty queue; drain stale events from the IDF
    // RX ISR and retry. Bail out only if AddToSet fails on an empty queue.
    // With `use_usj`, the queue is only fed with the task created afterwards,
    // so the loop only makes sense with the ISR path, code looks cleaner with a
    // unified loop.
    while (xQueueAddToSet(uart_data->rxqueue, event_set) != pdPASS) {
        uart_event_t stale_event;
        if (xQueueReceive(uart_data->rxqueue, &stale_event, 0) != pdTRUE) {
            ESP_LOGE(TAG, "failed to establish uart queue.");
            sys_unregister_listener(global, &uart_data->listener);
#ifndef AVM_NO_SMP
            smp_mutex_destroy(uart_data->reader_lock);
#endif
#if SOC_USB_SERIAL_JTAG_SUPPORTED
            if (use_usj) {
                vSemaphoreDelete(uart_data->usj_reader_stopped);
                vRingbufferDelete(uart_data->usj_rx_ringbuf);
                vQueueDelete(uart_data->rxqueue);
                usb_serial_jtag_driver_uninstall();
            }
#endif
#if SOC_USB_SERIAL_JTAG_SUPPORTED
            if (!use_usj)
#endif
            {
                uart_driver_delete(uart_num);
            }
            free(uart_data);
            return NULL;
        }
    }

#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (use_usj) {
        if (xTaskCreate(usj_reader_task, "usj_reader", 2560, uart_data,
                tskIDLE_PRIORITY + 1, &uart_data->usj_reader_task) != pdPASS) {
            ESP_LOGE(TAG, "failed to spawn USB_SERIAL_JTAG reader task.");
            xQueueRemoveFromSet(uart_data->rxqueue, event_set);
            sys_unregister_listener(global, &uart_data->listener);
#ifndef AVM_NO_SMP
            smp_mutex_destroy(uart_data->reader_lock);
#endif
            vSemaphoreDelete(uart_data->usj_reader_stopped);
            vRingbufferDelete(uart_data->usj_rx_ringbuf);
            vQueueDelete(uart_data->rxqueue);
            usb_serial_jtag_driver_uninstall();
            free(uart_data);
            return NULL;
        }
    }
#endif

    Context *ctx = context_new(global);
    ctx->native_handler = uart_driver_consume_mailbox;
    ctx->platform_data = uart_data;
    return ctx;
}

static void uart_driver_do_read(Context *ctx, GenMessage gen_message)
{
    GlobalContext *glb = ctx->global;
    struct UARTData *uart_data = ctx->platform_data;
    term pid = gen_message.pid;
    term ref = gen_message.ref;
    uint64_t ref_ticks = term_to_ref_ticks(ref);

    int local_pid = term_to_local_process_id(pid);

    if (uart_data->reader_process_pid != term_invalid_term()) {
        if (UNLIKELY(memory_ensure_free_with_roots(ctx, TUPLE_SIZE(2) * 2, 1, &ref, MEMORY_CAN_SHRINK) != MEMORY_GC_OK)) {
            ESP_LOGE(TAG, "[uart_driver_do_read] Failed to allocate space for error tuple");
            globalcontext_send_message(glb, local_pid, OUT_OF_MEMORY_ATOM);
            return;
        }

        term ealready = globalcontext_make_atom(glb, ATOM_STR("\x8", "ealready"));
        term error_tuple = port_create_error_tuple(ctx, ealready);
        port_send_reply(ctx, pid, ref, error_tuple);
        return;
    }

    size_t count = 0;
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (uart_data->use_usj) {
        count = usj_rx_available(uart_data);
    }
#endif
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (!uart_data->use_usj)
#endif
    {
        uart_get_buffered_data_len(uart_data->uart_num, &count);
    }

    if (count > 0) {
        uint8_t *usj_buf = NULL;
#if SOC_USB_SERIAL_JTAG_SUPPORTED
        if (uart_data->use_usj) {
            usj_buf = malloc(count);
            if (IS_NULL_PTR(usj_buf)) {
                fprintf(stderr, "Failed to allocate memory size %i: %s:%i.\n", (int) count, __FILE__, __LINE__);
                AVM_ABORT();
            }
            count = usj_drain_rx(uart_data, usj_buf, count);
            if (count == 0) {
                free(usj_buf);
                safe_update_reader_data(uart_data, pid, ref_ticks);
                return;
            }
        }
#endif
        int bin_size = term_binary_heap_size(count);
        if (UNLIKELY(memory_ensure_free_with_roots(ctx, bin_size + TUPLE_SIZE(2) * 2, 1, &ref, MEMORY_CAN_SHRINK) != MEMORY_GC_OK)) {
            free(usj_buf);
            ESP_LOGE(TAG, "[uart_driver_do_read] Failed to allocate space for return value");
            globalcontext_send_message(glb, local_pid, OUT_OF_MEMORY_ATOM);
            return;
        }

        term bin = term_create_uninitialized_binary(count, &ctx->heap, glb);
        uint8_t *bin_buf = (uint8_t *) term_binary_data(bin);
#if SOC_USB_SERIAL_JTAG_SUPPORTED
        if (uart_data->use_usj) {
            memcpy(bin_buf, usj_buf, count);
            free(usj_buf);
        }
#endif
#if SOC_USB_SERIAL_JTAG_SUPPORTED
        if (!uart_data->use_usj)
#endif
        {
            uart_read_bytes(uart_data->uart_num, bin_buf, count, portMAX_DELAY);
        }

        term ok_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(ok_tuple, 1, bin);

        port_send_reply(ctx, pid, ref, ok_tuple);

    } else {
        safe_update_reader_data(uart_data, pid, ref_ticks);
    }
}

