atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/uart_driver.c
static void uart_driver_do_cancel_read(Context *ctx, GenMessage gen_message)
{
    struct UARTData *uart_data = ctx->platform_data;

    safe_update_reader_data(uart_data, NO_READER, NO_REF);

    term pid = gen_message.pid;
    term ref = gen_message.ref;

    if (UNLIKELY(memory_ensure_free_with_roots(ctx, TUPLE_SIZE(2), 1, &ref, MEMORY_CAN_SHRINK) != MEMORY_GC_OK)) {
        ESP_LOGE(TAG, "[uart_driver_do_read] Failed to allocate space for return value");
        globalcontext_send_message(ctx->global, term_to_local_process_id(pid), OUT_OF_MEMORY_ATOM);
    }

    port_send_reply(ctx, pid, ref, OK_ATOM);
}

static void uart_driver_do_write(Context *ctx, GenMessage gen_message)
{
    GlobalContext *glb = ctx->global;
    struct UARTData *uart_data = ctx->platform_data;
    term msg = gen_message.req;
    term pid = gen_message.pid;
    term ref = gen_message.ref;

    term data = term_get_tuple_element(msg, 1);

    size_t buffer_size;
    switch (interop_iolist_size(data, &buffer_size)) {
        case InteropOk:
            break;
        case InteropMemoryAllocFail:
            ESP_LOGE(TAG, "[uart_driver_do_write] Failed to allocate memory");
            return;
        case InteropBadArg:
            ESP_LOGE(TAG, "[uart_driver_do_write] Bad arg");
            return;
    }
    void *buffer = malloc(buffer_size);
    switch (interop_write_iolist(data, buffer)) {
        case InteropOk:
            break;
        case InteropMemoryAllocFail:
            free(buffer);
            ESP_LOGE(TAG, "[uart_driver_do_write] Failed to allocate memory");
            return;
        case InteropBadArg:
            free(buffer);
            ESP_LOGE(TAG, "[uart_driver_do_write] Bad arg");
            return;
    }

#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (uart_data->use_usj) {
        usb_serial_jtag_write_bytes(buffer, buffer_size, portMAX_DELAY);
    }
#endif
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (!uart_data->use_usj)
#endif
    {
        uart_write_bytes(uart_data->uart_num, buffer, buffer_size);
    }

    free(buffer);

    int local_pid = term_to_local_process_id(pid);
    if (UNLIKELY(memory_ensure_free_with_roots(ctx, TUPLE_SIZE(2), 1, &ref, MEMORY_CAN_SHRINK) != MEMORY_GC_OK)) {
        ESP_LOGE(TAG, "[uart_driver_do_write] Failed to allocate space for return value");
        globalcontext_send_message(glb, local_pid, OUT_OF_MEMORY_ATOM);
    }

    port_send_reply(ctx, pid, ref, OK_ATOM);
}

static void uart_driver_do_close(Context *ctx, GenMessage gen_message)
{
    GlobalContext *glb = ctx->global;
    struct UARTData *uart_data = ctx->platform_data;
    term pid = gen_message.pid;
    term ref = gen_message.ref;

    sys_unregister_listener(glb, &uart_data->listener);
#ifndef AVM_NO_SMP
    smp_mutex_destroy(uart_data->reader_lock);
#endif

    term result = OK_ATOM;
    if (uart_data->rxqueue != NULL) {
        xQueueRemoveFromSet(uart_data->rxqueue, event_set);
    }
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (uart_data->use_usj) {
        usj_stop_reader_task(uart_data);
        if (uart_data->usj_rx_ringbuf != NULL) {
            vRingbufferDelete(uart_data->usj_rx_ringbuf);
        }
        if (uart_data->rxqueue != NULL) {
            vQueueDelete(uart_data->rxqueue);
        }
        esp_err_t err = usb_serial_jtag_driver_uninstall();
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "Failed to uninstall USB_SERIAL_JTAG driver: %s", esp_err_to_name(err));
            result = ERROR_ATOM;
        } else {
            result = OK_ATOM;
        }
    }
#endif
#if SOC_USB_SERIAL_JTAG_SUPPORTED
    if (!uart_data->use_usj)
#endif
    {
        esp_err_t err = uart_driver_delete(uart_data->uart_num);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "Failed to delete UART driver. Error: %s", esp_err_to_name(err));
            result = ERROR_ATOM;
        } else {
            result = OK_ATOM;
        }
    }

    if (UNLIKELY(memory_ensure_free_with_roots(ctx, TUPLE_SIZE(2), 1, &ref, MEMORY_CAN_SHRINK) != MEMORY_GC_OK)) {
        ESP_LOGE(TAG, "[uart_driver_do_close] Failed to allocate space for return value");
        globalcontext_send_message(glb, term_to_local_process_id(pid), OUT_OF_MEMORY_ATOM);
    }

    port_send_reply(ctx, pid, ref, result);

    free(uart_data);
    ctx->platform_data = NULL;
}

static NativeHandlerResult uart_driver_consume_mailbox(Context *ctx)
{
    GlobalContext *glb = ctx->global;
    bool is_closed = false;
    while (mailbox_has_next(&ctx->mailbox)) {
        Message *message = mailbox_first(&ctx->mailbox);
        term msg = message->message;
        GenMessage gen_message;
        if (UNLIKELY(port_parse_gen_message(msg, &gen_message) != GenCallMessage)) {
            ESP_LOGW(TAG, "Received invalid message.");
            mailbox_remove_message(&ctx->mailbox, &ctx->heap);
            return NativeContinue;
        }

        uint64_t ref_ticks = term_to_ref_ticks(gen_message.ref);

        int local_pid = term_to_local_process_id(gen_message.pid);

        if (is_closed) {
            if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) * 2 + TERM_BOXED_REFERENCE_SHORT_SIZE) != MEMORY_GC_OK)) {
                ESP_LOGE(TAG, "[uart_driver_consume_mailbox] Failed to allocate space for error tuple");
                globalcontext_send_message(glb, local_pid, OUT_OF_MEMORY_ATOM);
            }

            term error_tuple = term_alloc_tuple(2, &ctx->heap);
            term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
            term_put_tuple_element(error_tuple, 1, NOPROC_ATOM);

            term result_tuple = term_alloc_tuple(2, &ctx->heap);
            term_put_tuple_element(result_tuple, 0, term_from_ref_ticks(ref_ticks, &ctx->heap));
            term_put_tuple_element(result_tuple, 1, error_tuple);

            globalcontext_send_message(glb, local_pid, result_tuple);

            mailbox_remove_message(&ctx->mailbox, &ctx->heap);
            continue;
        }

        term req = gen_message.req;
        term cmd_term = term_is_atom(req) ? req : term_get_tuple_element(req, 0);

        enum uart_cmd cmd = interop_atom_term_select_int(cmd_table, cmd_term, ctx->global);
        switch (cmd) {
            case UARTReadCmd:
                TRACE("read\n");
                uart_driver_do_read(ctx, gen_message);
                break;

            case UARTWriteCmd:
                TRACE("write\n");
                uart_driver_do_write(ctx, gen_message);
                break;

            case UARTCloseCmd:
                TRACE("close\n");
                uart_driver_do_close(ctx, gen_message);
                is_closed = true;
                break;

            case UARTCancelCmd:
                TRACE("cancel_read\n");
                uart_driver_do_cancel_read(ctx, gen_message);
                break;

            default:
                TRACE("uart: error: unrecognized command.\n");
        }

        mailbox_remove_message(&ctx->mailbox, &ctx->heap);
    }
    return is_closed ? NativeTerminate : NativeContinue;
}

REGISTER_PORT_DRIVER(uart, NULL, NULL, uart_driver_create_port)

#endif
